DataProcessors/ЛБ_ЗаполнитьПереченьЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЛБ_ЗаполнитьПереченьЦБ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПеречня</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПеречней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаЦБ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаВключенияВПеречень</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЮридическоеФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фамилия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отчество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоРождения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гражданство</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_СтатусыКлиентаВПеречнях</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаЦБДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументИдентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументКемВыдан</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументСерия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументДатаВыдачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаКлиентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_СтатусыКлиентаВПеречнях</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВключенияВПеречень</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЛБ_ДокументыЗалогодателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ДокументыЗалогодателей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДУЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДоп</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Comment>Дата выдачи документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Comment>Кем выдан </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Comment>Серия документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Comment>Номер документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНеДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСтранаЭмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНаименованиеИногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокументаЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДокументовЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ПереченьНежелательныхЛицДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ПереченьНежелательныхЛицДокументы</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПеречней</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПеречня</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыПеречней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыПеречней</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Террористы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФРОМУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МВК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ООН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыДокументовЗалогодателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыДокументовЗалогодателя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументУдостоверяющийПравоПребыванияРФ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ЛБ_ЗаполнитьПереченьЦБ/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ДатаПеречня = ТекущаяДата();
	Объект.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ЦБ;
КонецПроцедуры

&НаСервере
Процедура ПоискДублейСтрокВТабЧасти(ТаблЗнач)	 
	 Удстроки = Новый СписокЗначений;

	 Отбор = Новый Структура();

	 Для каждого Стр Из ТаблЗнач Цикл
		 Если НЕ Удстроки.НайтиПоЗначению(Стр) = неопределено Тогда
			 Продолжить;
		 КонецЕсли;	 
	     Отбор.Очистить();
	     Для каждого Колонки Из ТаблЗнач.Колонки Цикл
	         Если Колонки.Имя <> "НомерСтроки" Тогда
	             Отбор.Вставить(Колонки.Имя, Стр[Колонки.Имя]);
	         КонецЕсли;
	      КонецЦикла;

		  Строки = ТаблЗнач.НайтиСтроки(Отбор);
		  Если Строки.Количество() > 1 Тогда 
			  Для сч = 1 По Строки.Количество()-1 цикл 				  
				  Удстроки.Добавить(Строки[сч]);
			  Конеццикла;	  
		  КонецЕсли; 
	  КонецЦикла;
	  Для каждого Эл Из Удстроки Цикл 
		  ТаблЗнач.Удалить(Эл.Значение); 
	  Конеццикла;	  
КонецПроцедуры

&НаСервере
Процедура ПоискДублейСтрокВТабЧастиОсн(ТаблЗнач)	 
	 Удстроки = Новый СписокЗначений;

	 Отбор = Новый Структура();

	 Для каждого Стр Из ТаблЗнач Цикл
		 Если НЕ Удстроки.НайтиПоЗначению(Стр) = неопределено Тогда
			 Продолжить;
		 КонецЕсли;	 
	     Отбор.Очистить();
	     Отбор.Вставить("ИД", Стр.ИД);
	     Отбор.Вставить("Статус", Стр.Статус);
		 
		  Строки = ТаблЗнач.НайтиСтроки(Отбор);
		  Если Строки.Количество() > 1 Тогда 
			  Для сч = 1 По Строки.Количество()-1 цикл 				  
				  Удстроки.Добавить(Строки[сч]);
			  Конеццикла;	  
		  КонецЕсли; 
	  КонецЦикла;
	  Для каждого Эл Из Удстроки Цикл 
		  ТаблЗнач.Удалить(Эл.Значение); 
	  Конеццикла;	  
КонецПроцедуры    
  
Функция ПолучитьНаименованиеДокумента(Код) 
	ОтборДок = Новый Структура;
	ОтборДок.Вставить("Код", Код);
	СтрокиДок = НаименованияДок.НайтиСтроки(ОтборДок);
	Если НЕ СтрокиДок.Количество() = 0 Тогда
		Возврат СтрокиДок.Получить(0).Наименование;
	КонецЕсли;  
		
	ЗапросДок = Новый Запрос; 
	ЗапросДок.УстановитьПараметр("Код", СокрЛП(Код));
	ЗапросДок.Текст = "ВЫБРАТЬ
	                  |	ВидыДокументовФизическихЛиц.Наименование КАК Наименование
	                  |ИЗ
	                  |	Справочник.ВидыДокументовФизическихЛиц КАК ВидыДокументовФизическихЛиц
	                  |ГДЕ
	                  |	ВидыДокументовФизическихЛиц.КодМВД = &Код"; 
	ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
	Если ВыборкаДок.Следующий() Тогда 
		СтрН = НаименованияДок.Добавить(); 
	    СтрН.код = СокрЛП(Код);
		СтрН.Наименование = СокрЛП(ВыборкаДок.Наименование);
		
		Возврат СтрН.Наименование;
	КонецЕсли;	
	
	Возврат "";
КонецФункции	

&НаСервере
Процедура ПроверкаКлиентов() 
	Объект.ТаблицаКлиентов.Очистить(); 		
		
    Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("ВидДокументаЗалогодателя", Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателя.Владелец КАК Клиент,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателя.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.ЛБ_ДокументыЗалогодателя КАК ЛБ_ДокументыЗалогодателя
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних КАК ЛБ_ДокументыЗалогодателейСрезПоследних
	               |		ПО (ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя = ЛБ_ДокументыЗалогодателя.Ссылка)
	               |ГДЕ
	               |	ЛБ_ДокументыЗалогодателя.ВидДокументаЗалогодателя = &ВидДокументаЗалогодателя";
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Залогодатели.Ссылка КАК Клиент,
	               |	ЛБ_Залогодатели.Наименование КАК Наименование,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	               |	ЛБ_АнкетаЗалогодателяСрезПоследних.ИНН КАК ИНН,
	               |	ЛБ_АнкетаЗалогодателяСрезПоследних.ТипФизЛица КАК ЮридическоеФизическоеЛицо,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия_А КАК Фамилия_А,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя_А КАК Имя_А,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество_А КАК Отчество_А
	               |ИЗ
	               |	Справочник.ЛБ_Залогодатели КАК ЛБ_Залогодатели
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних
	               |		ПО (ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Залогодатель = ЛБ_Залогодатели.Ссылка)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_АнкетаЗалогодателя.СрезПоследних КАК ЛБ_АнкетаЗалогодателяСрезПоследних
	               |		ПО (ЛБ_АнкетаЗалогодателяСрезПоследних.Залогодатель = ЛБ_Залогодатели.Ссылка)
	               |ГДЕ
	               |	ЛБ_Залогодатели.ПометкаУдаления = ЛОЖЬ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Наименование = Врег(СокрЛП(Выборка.Наименование)); 
		НаименованиеЛат = СокрЛП(Выборка.Фамилия_А) + ?(ПустаяСтрока(Выборка.Имя_А), "", " " + СокрЛП(Выборка.Имя_А)) + ?(ПустаяСтрока(Выборка.Отчество_А), "", " " + СокрЛП(Выборка.Отчество_А));
		НаименованиеЛат = Врег(НаименованиеЛат);
		ДатаРождения = Выборка.ДатаРождения;
		ГодРождения = Год(ДатаРождения); 
		ИНН = СокрЛП(Выборка.ИНН);
		ЮридическоеФизическоеЛицо = Выборка.ЮридическоеФизическоеЛицо;
		ЕстьСовпадение = ложь;
		Отбор = Новый Структура;
		Отбор.Вставить("Наименование", Наименование);
		Отбор.Вставить("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);
		СтрокиК = Объект.ТаблицаЦБ.НайтиСтроки(Отбор);
		Если НЕ СтрокиК.Количество() = 0 Тогда 
			Для каждого СтрК Из СтрокиК Цикл  
				Если НЕ СтрК.ДатаРождения = Дата(1,1,1) Тогда 
					Если СтрК.ДатаРождения = ДатаРождения Тогда
					    НоваяСтр = Объект.ТаблицаКлиентов.Добавить();
						НоваяСтр.ИД = СтрК.ИД;
						НоваяСтр.Клиент = Выборка.Клиент;
						НоваяСтр.Статус = СтрК.Статус;
						НоваяСтр.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
						ЕстьСовпадение = Истина;
						Прервать;
					КонецЕсли;	
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли; 			
		Если ЕстьСовпадение Тогда
			Продолжить;
		КонецЕсли;  
				
		ОтборДок = Новый Структура;
		ОтборДок.Вставить("Клиент", Выборка.Клиент);
		СтрокиДок = ТаблицаДокументов.НайтиСтроки(ОтборДок);
		Для каждого СтрДок Из СтрокиДок Цикл 
			ОтборК = Новый Структура;
			ОтборК.Вставить("ДокументНомер", СокрЛП(СтрДок.ДокументНомер));
			ОтборК.Вставить("ДокументСерия", СокрЛП(СтрДок.ДокументСерия));
			СтрокиК = Объект.ТаблицаЦБДокументы.НайтиСтроки(ОтборК); 
			Если НЕ СтрокиК.Количество() = 0 Тогда 
				Для каждого СтрК Из СтрокиК Цикл  
					ОтборИД = Новый Структура; 
					ОтборИД.Вставить("ИД", СтрК.ИД);
					СтрокиИД = Объект.ТаблицаЦБ.НайтиСтроки(ОтборИД);
					Если НЕ СтрокиИД.Количество() = 0 Тогда  
						СтрИД = СтрокиИД.Получить(0);
						Если НЕ СтрИД.ДатаРождения = Дата(1,1,1) Тогда 
							Если СтрИД.ДатаРождения = ДатаРождения Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
								НоваяСтр.ИД = СтрИД.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрИД.Статус; 
								НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;	
						КонецЕсли;	
				        Если НЕ ПустаяСтрока(ИНН) Тогда 
							Если СтрИД.ИНН = ИНН Тогда
							    НоваяСтр = Объект.ТаблицаКлиентов.Добавить(); 
								НоваяСтр.ИД = СтрИД.ИД;
								НоваяСтр.Клиент = Выборка.Клиент;
								НоваяСтр.Статус = СтрИД.Статус;  
								НоваяСтр.ДатаВключенияВПеречень = СтрИД.ДатаВключенияВПеречень;
								ЕстьСовпадение = Истина;
								Прервать;
							КонецЕсли;				
						КонецЕсли;
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;  
            Если ЕстьСовпадение Тогда
				Прервать;
			КонецЕсли; 
  		КонецЦикла;					
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзПеречня639НаСервере()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Перечень639.ФИО КАК ФИО,
	               |	ЛБ_Перечень639.ДатаРождения КАК ДатаРождения,
	               |	ЛБ_Перечень639.КодКлиента КАК КодКлиента,
	               |	ЛБ_Перечень639.Фамилия КАК Фамилия,
	               |	ЛБ_Перечень639.Имя КАК Имя,
	               |	ЛБ_Перечень639.Отчество КАК Отчество,
	               |	ЛБ_Перечень639.КодДокумента КАК КодДокумента,
	               |	ЛБ_Перечень639.СерияДокумента КАК СерияДокумента,
	               |	ЛБ_Перечень639.НомерДокумента КАК НомерДокумента,
	               |	ЛБ_Перечень639.ДатаДокумента КАК ДатаДокумента,
	               |	ЛБ_Перечень639.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_Перечень639.ДатаФиксации КАК ДатаФиксации
	               |ИЗ
	               |	РегистрСведений.ЛБ_Перечень639 КАК ЛБ_Перечень639
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ФИО";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();	
		
	ИД = Год(Объект.ДатаПеречня) + Месяц(Объект.ДатаПеречня) + День(Объект.ДатаПеречня);
	Для каждого СтрК Из ТаблицаЗапроса цикл 
		Отбор = Новый структура;
		Отбор.Вставить("Фамилия", Врег(СокрЛП(СтрК.Фамилия))); 
		Отбор.Вставить("Имя", Врег(СокрЛП(СтрК.Имя)));
		Отбор.Вставить("Отчество", Врег(СокрЛП(СтрК.Отчество)));
		Отбор.Вставить("ДатаРождения", СтрК.ДатаРождения);
		
		Строки = Объект.ТаблицаЦБ.НайтиСтроки(Отбор); 
		Если НЕ Строки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;	
		
		ИД = ИД + 1;
		НоваяСтр = Объект.ТаблицаЦБ.Добавить();
		НоваяСтр.ДатаВключенияВПеречень = ?(СтрК.ДатаФиксации = Дата(1,1,1), Объект.ДатаПеречня, СтрК.ДатаФиксации);
		НоваяСтр.ИД = Формат(ИД, "ЧГ=0"); 
		НоваяСтр.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
		НоваяСтр.Наименование = Врег(СокрЛП(СтрК.ФИО));
		НоваяСтр.Фамилия = Врег(СокрЛП(СтрК.Фамилия));
		НоваяСтр.Имя = Врег(СокрЛП(СтрК.Имя));
		НоваяСтр.Отчество = Врег(СокрЛП(СтрК.Отчество));
		НоваяСтр.ДатаРождения = СтрК.ДатаРождения;
		НоваяСтр.Статус = Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен;
		НоваяСтр.Гражданство = справочники.СтраныМира.Россия;
		
    	НоваяСтрД = Объект.ТаблицаЦБДокументы.Добавить();
		НоваяСтрД.ИД = НоваяСтр.ИД; 
		НоваяСтрД.ДокументИдентификатор = СтрК.КодДокумента;  
		НоваяСтрД.ДокументНаименование = ПолучитьНаименованиеДокумента(СтрК.КодДокумента);   
		НоваяСтрД.ДокументСерия = СтрК.СерияДокумента; 
		НоваяСтрД.ДокументНомер = СтрК.НомерДокумента;
		НоваяСтрД.ДокументКемВыдан = СтрК.ДокументКемВыдан;
		НоваяСтрД.ДокументДатаВыдачи = СтрК.ДатаДокумента;
	Конеццикла;		
		
	Если НЕ Объект.ТаблицаЦБ.Количество() = 0 Тогда
		ТаблЗнач = Объект.ТаблицаЦБ.Выгрузить();
		ПоискДублейСтрокВТабЧастиОсн(ТаблЗнач);
		Рег = РегистрыСведений.ЛБ_ПереченьНежелательныхЛиц;
	    НаборЗаписей = Рег.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня); 
		НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня);
		
		Для Каждого СтрокаТаблицы Из ТаблЗнач Цикл 	   
		   НоваяЗапись = НаборЗаписей.Добавить(); 
		   НоваяЗапись.Период = Объект.ДатаПеречня; 
		   НоваяЗапись.ВидПеречня = Объект.ВидПеречня; 
		   НоваяЗапись.ДатаПеречня = Объект.ДатаПеречня;
		   НоваяЗапись.ДатаВключенияВПеречень = СтрокаТаблицы.ДатаВключенияВПеречень; 
		   НоваяЗапись.ИД = СтрокаТаблицы.ИД;  
		   НоваяЗапись.ЮридическоеФизическоеЛицо = СтрокаТаблицы.ЮридическоеФизическоеЛицо;
		   НоваяЗапись.ДатаРождения = СтрокаТаблицы.ДатаРождения;
		   НоваяЗапись.Гражданство = СтрокаТаблицы.Гражданство;
		   НоваяЗапись.ИНН = СтрокаТаблицы.ИНН;
		   НоваяЗапись.Фамилия = СтрокаТаблицы.Фамилия; 
		   НоваяЗапись.Имя = СтрокаТаблицы.Имя;
		   НоваяЗапись.Отчество = СтрокаТаблицы.Отчество; 
		   НоваяЗапись.Наименование = СокрЛП(СтрокаТаблицы.Наименование); 
		   НоваяЗапись.Статус = СтрокаТаблицы.Статус;
		   НоваяЗапись.Ответственный = Пользователи.ТекущийПользователь(); 
		   НоваяЗапись.Примечание = "Загружено из Эликса";
		 КонецЦикла; 

		НаборЗаписей.Записать(Истина); 	     
	КонецЕсли;	
		
	Если НЕ Объект.ТаблицаЦБДокументы.Количество() = 0 Тогда  
		ТаблЗнач = Объект.ТаблицаЦБДокументы.Выгрузить();       
		ПоискДублейСтрокВТабЧасти(ТаблЗнач);
		Рег = РегистрыСведений.ЛБ_ПереченьНежелательныхЛицДокументы;
	    НаборЗаписей = Рег.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня);
		НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня);
		
		Для Каждого СтрокаТаблицы Из ТаблЗнач Цикл 	
		    НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период = Объект.ДатаПеречня;   
			НоваяЗапись.ВидПеречня = Объект.ВидПеречня;
			НоваяЗапись.ДатаПеречня = Объект.ДатаПеречня;
			НоваяЗапись.ИД = СтрокаТаблицы.ИД;
		    НоваяЗапись.ДокументИдентификатор = СтрокаТаблицы.ДокументИдентификатор;
		    НоваяЗапись.ДокументНаименование = СтрокаТаблицы.ДокументНаименование;
		    НоваяЗапись.ДокументСерия = СтрокаТаблицы.ДокументСерия; 
			НоваяЗапись.ДокументНомер = СтрокаТаблицы.ДокументНомер;
			НоваяЗапись.ДокументКемВыдан = СтрокаТаблицы.ДокументКемВыдан; 
			НоваяЗапись.ДокументДатаВыдачи = СтрокаТаблицы.ДокументДатаВыдачи; 
		КонецЦикла; 

		НаборЗаписей.Записать(Истина);    
	КонецЕсли;	     
	
	ПроверкаКлиентов();	
	
	Если НЕ Объект.ТаблицаКлиентов.Количество() = 0 Тогда 
		Рег = РегистрыСведений.ЛБ_КлиентыВПеречнях;
		НаборЗаписей = Рег.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВидПеречня.Установить(Объект.ВидПеречня); 
		НаборЗаписей.Отбор.ДатаПеречня.Установить(Объект.ДатаПеречня);
		НаборЗаписей.Отбор.ВидПроверки.Установить(Перечисления.ЛБ_ВидыПроверкиПеречней.ПроверкаПоПеречню);

		Для каждого СтрК Из Объект.ТаблицаКлиентов Цикл 
			НоваяЗапись = НаборЗаписей.Добавить();   
			НоваяЗапись.Период = ТекущаяДата();
			НоваяЗапись.ВидПроверки = Перечисления.ЛБ_ВидыПроверкиПеречней.ПроверкаПоПеречню;
			НоваяЗапись.ВидПеречня = Объект.ВидПеречня; 
		    НоваяЗапись.ДатаПеречня = Объект.ДатаПеречня;
			НоваяЗапись.Залогодатель = СтрК.Клиент;
			НоваяЗапись.СтатусКлиентаВПеречне = СтрК.Статус; 
			НоваяЗапись.ИД = СтрК.ИД;  
			НоваяЗапись.ДатаВключенияВПеречень = СтрК.ДатаВключенияВПеречень;
			НоваяЗапись.Ответственный = Пользователи.ТекущийПользователь(); 
		Конеццикла;	 
						
		НаборЗаписей.Записать(Истина);
	КонецЕсли;	 

КонецПроцедуры
	
&НаКлиенте
Процедура ЗаполнитьИзПеречня639(Команда)  
	ЗаполнитьИзПеречня639НаСервере(); 
	
	ПараметрыФормы = новый Структура;
	ПараметрыФормы.Вставить("ВидПеречня", Объект.ВидПеречня); 
	ПараметрыФормы.Вставить("ДатаСверки", Объект.ДатаПеречня); 
	ПараметрыФормы.Вставить("МассивКлиентов", ПолучитьМассивКлиентовВПеречне());  
	
	ОткрытьФорму("Отчет.ЛБ_РезультатСверкиПоПеречням.Форма.ФормаОтчета", ПараметрыФормы, Этаформа);
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивКлиентовВПеречне()
	Возврат ЛБ_УправлениеЛомбардом.ПреобразованиеТаблицыЗначенийВМассив(Объект.ТаблицаКлиентов.Выгрузить());
КонецФункции
